#	Напишите функцию которая возвращает длину принимаемой строки, по умолчанию строка пустая (s=’’).

s=''
x='asd'
def length_string(s): #Функция
    print(len(s)) #пропиши длину строки

length_string(s) #проверка
length_string(x) #проверка
