#3)	Напишите функцию которая:
#a)	принимает список с произвольными значениями
#b)	добавляет к нему произвольное значение
#c)	возвращает результирующий список



b = [5,10,15,29,25] #список

def Rlength_string(spis1): #Функция
    abracadbra=[2,1,4] #то что добавляем
    kek=b
    Proisvol=kek.append(abracadbra)
    print(kek)

print(b)
Rlength_string(b) #Вроде так

